Autodesk.Revit.DB.Plumbing.PlumbingUtils.ConvertPipePlaceholders(Autodesk.Revit.DB.Document,System.Collections.Generic.ICollection`1{Autodesk.Revit.DB.ElementId})
Converts a collection of pipe placeholder elements into pipe elements.
Remarks:
Once conversion succeeds, the pipe placeholder elements are deleted.
The new pipe and fitting elements are created and connections are established.
document:
The document.
placeholderIds:
A collection of element IDs of pipe placeholders.
Returns:
A collection of element IDs of pipe and fitting.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given element id set is empty.
-or-
The given element ids (placeholderIds) are not pipe placeholders.
-or-
The elements belong to different types of system.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012